backend-api/app/Controllers/AuthController.php

    public function login()
    {
        // Ambil data dari request
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // Validasi input
        if (!$username || !$password) {
            return $this->respond([
                'status' => 'error',
                'message' => 'Username dan password wajib diisi'
            ], 400);
        }

        // Cari user di database
        $model = new UserModel();
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1