backend-api/app/Controllers/BarangController.php

    public function create()
    {
        $model = new BarangModel();
        $json = $this->request->getJSON();

        $nama_barang = $json->nama_barang ?? $this->request->getPost('nama_barang');
        $harga = $json->harga ?? $this->request->getPost('harga');
        $stok = $json->stok ?? $this->request->getPost('stok');
        $id_kategori = $json->id_kategori ?? $this->request->getPost('id_kategori');
        $id_supplier = $json->id_supplier ?? $this->request->getPost('id_supplier');

        if (!$nama_barang || !$id_kategori || !$id_supplier) {
            return $this->respond([
                'status' => 'error',
                'message' => 'Nama barang, kategori, dan supplier wajib diisi'
            ], 400);
        }

        $data = [
            'nama_barang' => $nama_barang,
            'harga' => $harga ?? 0,
            'stok' => $stok ?? 0,
            'id_kategori' => $id_kategori,
            'id_supplier' => $id_supplier
        ];

        $model->save($data);
---
INSERT INTO `barang` (`nama_barang`, `harga`, `stok`, `id_kategori`, `id_supplier`, `created_at`, `updated_at`) VALUES ('pulpen', 100000, 100, 3, 3, '2026-06-23 12:55:43', '2026-06-23 12:55:43')