backend-api/app/Controllers/KategoriController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $model = new KategoriModel();
        $data = $model->findAll();

SELECT *
FROM `kategori`
WHERE `kategori`.`id` = '1'
DELETE FROM `kategori`
WHERE `id` IN ('1')
---
    public function delete($id = null)
    {
        $model = new KategoriModel();
        $data = $model->find($id);

        if (!$data) {
            return $this->respond([
                'status' => 'error',
                'message' => 'Kategori tidak ditemukan'
            ], 404);
        }

        $model->delete($id);