backend-api/app/Controllers/SupplierController.php

    public function index()
    {
        $model = new SupplierModel();
        $data = $model->findAll();
---
SELECT *
FROM `supplier`

    public function create()
    {
        $model = new SupplierModel();
        $json = $this->request->getJSON();

        $nama_supplier = $json->nama_supplier ?? $this->request->getPost('nama_supplier');
        $alamat = $json->alamat ?? $this->request->getPost('alamat');
        $kontak = $json->kontak ?? $this->request->getPost('kontak');

        if (!$nama_supplier) {
            return $this->respond([
                'status' => 'error',
                'message' => 'Nama supplier wajib diisi'
            ], 400);
        }

        $data = [
            'nama_supplier' => $nama_supplier,
            'alamat' => $alamat,
            'kontak' => $kontak
        ];

        $model->save($data);
---
INSERT INTO `supplier` (`nama_supplier`, `alamat`, `kontak`) VALUES ('PT. Minuman Seger', 'Jl. Pahlawan No. 29, Jakarta', '086789012345')

    public function delete($id = null)
    {
        $model = new SupplierModel();
        $data = $model->find($id);

        if (!$data) {
            return $this->respond([
                'status' => 'error',
                'message' => 'Supplier tidak ditemukan'
            ], 404);
        }

        $model->delete($id);
---
SELECT *
FROM `supplier`
WHERE `supplier`.`id` = '1'
DELETE FROM `supplier`
WHERE `id` IN ('1')