backend-api/app/Models/BarangModel.php

    public function getBarangLengkap()
    {
        return $this->select('barang.*, kategori.nama_kategori, supplier.nama_supplier')
                    ->join('kategori', 'kategori.id = barang.id_kategori')
                    ->join('supplier', 'supplier.id = barang.id_supplier')
                    ->findAll();
---
SELECT `barang`.*, `kategori`.`nama_kategori`, `supplier`.`nama_supplier`
FROM `barang`
JOIN `kategori` ON `kategori`.`id` = `barang`.`id_kategori`
JOIN `supplier` ON `supplier`.`id` = `barang`.`id_supplier`